Repository: Sager1145/Rina-Chan-board-370-leds
Catalog: ios/RinaBoard/Resources/Localizable.xcstrings
Source language: zh_hans
Languages: en, ja, zh_hant

source: 板子未能加入热点。请确认个人热点已开启，名称和密码正确，并按需打开“最大兼容性”。
en: The board could not join the hotspot. Make sure Personal Hotspot is on, the name and password are correct, and Maximize Compatibility is enabled if needed.
ja: ボードがインターネット共有に接続できませんでした。インターネット共有がオンで、ネットワーク名とパスワードが正しいことを確認し、必要に応じて「互換性を優先」をオンにしてください。
zh_hant: 板子無法加入熱點。請確認個人熱點已開啟、名稱和密碼正確，並視需要開啟「最大化相容性」。

source: 板子未能加入这个网络，请检查密码和信号后重试。
en: The board could not join this network. Check the password and signal, then try again.
ja: ボードがこのネットワークに接続できませんでした。パスワードと電波状況を確認して、もう一度お試しください。
zh_hant: 板子無法加入此網路。請檢查密碼和訊號後再試一次。

source: 板子直连
en: Direct board connection
ja: ボードへ直接接続
zh_hant: 板子直連

source: 板子直连热点 · %@
en: Board direct hotspot · %@
ja: ボードの直接接続用ホットスポット · %@
zh_hant: 板子直連熱點 · %@

source: 板载 Wi-Fi 模式
en: Board Wi-Fi mode
ja: ボードの Wi-Fi モード
zh_hant: 板載 Wi-Fi 模式

source: 板载 Wi-Fi 设置
en: Board Wi-Fi Settings
ja: ボードの Wi-Fi 設定
zh_hant: 板載 Wi-Fi 設定

source: 构建
en: Build
ja: ビルド
zh_hant: 組建

source: 查看
en: View
ja: 表示

source: 查看表情库
en: View face library
ja: 表情ライブラリを表示
zh_hant: 查看表情庫

source: 查看设备诊断、日志、测试工具与原始数据。
en: View device diagnostics, logs, test tools, and raw data.
ja: デバイス診断、ログ、テストツール、生データを表示します。
zh_hant: 查看裝置診斷、記錄、測試工具與原始資料。

source: 标准
en: Standard
ja: 標準
zh_hant: 標準

source: 校准
en: Calibrate
ja: キャリブレーション
zh_hant: 校準

source: 校验
en: Validate
ja: 検証
zh_hant: 驗證

source: 校验 JSON
en: Validate JSON
ja: JSON を検証
zh_hant: 驗證 JSON

source: 格式应为 #RRGGBB
en: Format must be #RRGGBB
ja: 形式は #RRGGBB にしてください
zh_hant: 格式必須為 #RRGGBB

source: 棋盘
en: Checkerboard
ja: 市松模様
zh_hant: 棋盤

source: 概览
en: Overview
ja: 概要
zh_hant: 概覽

source: 模式
en: Mode
ja: モード

source: 模式与表情
en: Mode & faces

source: 歌曲
en: Song
ja: 楽曲

source: 正在使用此热点名称对应的钥匙串密码
en: Using the Keychain password saved for this hotspot name
ja: このネットワーク名用にキーチェーンへ保存したパスワードを使用中
zh_hant: 正在使用此熱點名稱對應的鑰匙圈密碼

source: 正在充电
en: Charging
ja: 充電中
zh_hant: 充電中

source: 正在发送…
en: Sending…
ja: 送信中…
zh_hant: 正在傳送…

source: 正在建立实际控制连接
en: Establishing the control connection
ja: 制御接続を確立中
zh_hant: 正在建立實際控制連線

source: 正在把凭据发送给璃奈板
en: Sending credentials to the Rina board
ja: 璃奈ちゃんボードへ認証情報を送信中
zh_hant: 正在將憑證傳送給璃奈板

source: 正在接收固件日志
en: Receiving firmware logs
ja: ファームウェアログを受信中
zh_hant: 正在接收韌體記錄

source: 正在搜索支持 RinaLink 的蓝牙设备…
en: Searching for Bluetooth devices that support RinaLink…
ja: RinaLink 対応の Bluetooth デバイスを検索中…
zh_hant: 正在搜尋支援 RinaLink 的藍牙裝置…

source: 正在等待 iPhone 加入璃奈板热点
en: Waiting for the iPhone to join the Rina board's hotspot
ja: iPhone が璃奈ちゃんボードのホットスポットに参加するのを待っています
zh_hant: 正在等待 iPhone 加入璃奈板熱點

source: 正在编辑：%@
en: Editing: %@
ja: 編集中：%@
zh_hant: 正在編輯：%@

source: 正在解析地址
en: Resolving address
ja: アドレスを解決中
zh_hant: 正在解析位址

source: 正在订阅固件日志…
en: Subscribing to firmware logs…
ja: ファームウェアログを購読中…
zh_hant: 正在訂閱韌體記錄…

source: 正在请求权限
en: Requesting permission
ja: 権限を要求中
zh_hant: 正在要求權限

source: 正在读取
en: Reading
ja: 読み取り中
zh_hant: 正在讀取

source: 正在读取地址
en: Reading address
ja: アドレスを取得中
zh_hant: 正在讀取位址

source: 正在读取面板快照…
en: Reading board snapshot…
ja: ボードのスナップショットを読み取り中…
zh_hant: 正在讀取面板快照…

source: 正在输出到面板
en: Live on the board
ja: ボードに出力中
zh_hant: 正在輸出到面板

source: 正在连接
en: Connecting
ja: 接続中
zh_hant: 正在連線

source: 正常
en: Normal
ja: 通常
zh_hant: 一般

source: 此操作会删除所有非默认表情，且不可撤销。输入 CLEAR 确认。
en: This will delete all non-default faces and cannot be undone. Type CLEAR to confirm.
ja: この操作はデフォルト以外のすべての表情を削除し、取り消せません。確認のため CLEAR と入力してください。
zh_hant: 此操作會刪除所有非預設表情，且無法復原。請輸入 CLEAR 以確認。

source: 此表情的帧数据无效
en: This face has invalid frame data
ja: この表情のフレームデータは無効です
zh_hant: 此表情的影格資料無效

source: 每个元音对应一个嘴巴部件；眼睛和脸颊在同步期间保持不变。
en: Each vowel maps to one mouth part; the eyes and cheeks stay put while syncing.
ja: 母音ごとに 1 つの口パーツが対応します。同期中、目と頬は変わりません。
zh_hant: 每個母音對應一個嘴巴元件；眼睛與臉頰在同步期間維持不變。

source: 没有匹配字段
en: No matching fields
ja: 一致するフィールドがありません
zh_hant: 沒有相符的欄位

source: 没有匹配的日志
en: No matching logs
ja: 一致するログがありません
zh_hant: 沒有相符的記錄

source: 没有匹配的璃奈板
en: No matching Rina boards
ja: 一致する璃奈ちゃんボードがありません
zh_hant: 沒有相符的璃奈板

source: 没有搜索结果
en: No search results
ja: 検索結果がありません
zh_hant: 沒有搜尋結果

source: 没有活动连接
en: No active connection
ja: 有効な接続はありません
zh_hant: 沒有作用中的連線

source: 没有采集到足够的声音，请靠近麦克风再试一次
en: Not enough sound was captured — move closer to the microphone and try again
ja: 十分な音を取得できませんでした。マイクに近づいて、もう一度お試しください
zh_hant: 沒有收到足夠的聲音，請靠近麥克風再試一次

source: 测试
en: Tests
ja: テスト
zh_hant: 測試

source: 测试图案
en: Test pattern
ja: テストパターン
zh_hant: 測試圖樣

source: 测试图案先在本机预览；只有“发送当前预览”会改变面板输出。
en: Test patterns are previewed on this device first; only Send Current Preview changes the board's output.
ja: テストパターンは最初にこのデバイスでプレビューされます。「現在のプレビューを送信」を実行した場合だけボードの出力が変わります。
zh_hant: 測試圖樣會先在本機預覽；只有「傳送目前預覽」會改變面板輸出。

source: 清空
en: Clear
ja: 消去

source: 清空用户表情
en: Delete all user faces
ja: ユーザー表情をすべて削除
zh_hant: 清空使用者表情

source: 清空用户表情失败：%@
en: Failed to clear user faces: %@
ja: ユーザー表情を消去できませんでした：%@
zh_hant: 清除使用者表情失敗：%@

source: 清空用户表情已被新的输出操作替代
en: Clearing user faces was replaced by a newer output operation
ja: ユーザー表情の消去は新しい出力操作に置き換えられました
zh_hant: 清除使用者表情已被新的輸出操作取代

source: 清空用户表情被设备拒绝
en: The device rejected clearing user faces
ja: デバイスがユーザー表情の消去を拒否しました
zh_hant: 裝置拒絕清除使用者表情

source: 清除
en: Clear
ja: クリア

source: 清除板子和本机保存的热点密码
en: Clear hotspot password from the board and this device
ja: ボードとこのデバイスに保存したホットスポットのパスワードを消去
zh_hant: 清除板子和本機儲存的熱點密碼

source: 清除错误
en: Clear error
ja: エラーをクリア
zh_hant: 清除錯誤

source: 滚动文字
en: Scroll text

source: 滚动文字内容
en: Scrolling text content
ja: スクロールテキストの内容
zh_hant: 跑馬燈文字內容

source: 滚动文字预览，暂无内容
en: Scrolling text preview, nothing to show
ja: スクロールテキストのプレビュー、表示する内容がありません
zh_hant: 跑馬燈文字預覽，目前沒有內容

source: 滚动文字预览，第 %1$lld 帧，共 %2$lld 帧
en: Scrolling text preview, frame %1$lld of %2$lld
ja: スクロールテキストのプレビュー、%2$lld フレーム中 %1$lld フレーム目
zh_hant: 跑馬燈文字預覽，第 %1$lld 影格，共 %2$lld 影格

source: 滚动速度
en: Scroll speed
ja: スクロール速度
zh_hant: 捲動速度

source: 演出
en: Live

source: 演出脚本加载失败：%@
en: Could not load the performance script: %@
ja: パフォーマンススクリプトを読み込めませんでした：%@
zh_hant: 演出腳本載入失敗：%@

source: 演出脚本编码无效
en: The performance script is not valid text
ja: パフォーマンススクリプトが有効なテキストではありません
zh_hant: 演出腳本編碼無效

source: 演出进度
en: Performance progress
ja: 演出の進行状況
zh_hant: 演出進度

source: 演出预览，显示当前表情
en: Performance preview showing the current face
ja: 現在の表情を表示する演出プレビュー
zh_hant: 演出預覽，顯示目前表情

source: 演出预览，暂无内容
en: Performance preview, nothing loaded
ja: パフォーマンスのプレビュー、読み込まれた内容がありません
zh_hant: 演出預覽，目前沒有內容

source: 演出预览，第 %1$lld 关键帧，共 %2$lld 个
en: Performance preview, keyframe %1$lld of %2$lld
ja: パフォーマンスのプレビュー、%2$lld 個中 %1$lld 番目のキーフレーム
zh_hant: 演出預覽，第 %1$lld 個關鍵影格，共 %2$lld 個

source: 演示脚本
en: Demo script
ja: デモスクリプト
zh_hant: 示範腳本

source: 演示脚本加载失败：%@
en: Could not load the demo script: %@
ja: デモスクリプトを読み込めませんでした：%@
zh_hant: 示範腳本載入失敗：%@

source: 演示脚本编码无效
en: The demo script is not valid text
ja: デモスクリプトが有効なテキストではありません
zh_hant: 示範腳本編碼無效

source: 灵敏度 %.0f dB
en: Sensitivity %.0f dB
ja: 感度 %.0f dB
zh_hant: 靈敏度 %.0f dB

source: 灵敏度是判定为静音的音量下限；防抖帧数取最近若干次识别结果的众数，1 表示不防抖。切换识别模型会重置校准。
en: Sensitivity is the level below which a window counts as silence. Smoothing takes the most common result of the last few frames; 1 disables it. Switching the voice model resets calibration.
ja: 感度は、無音と判定する音量の下限です。スムージングは直近数フレームの認識結果の最頻値をとり、1 でスムージングなしになります。音声モデルを切り替えると、キャリブレーションはリセットされます。
zh_hant: 靈敏度是判定為靜音的音量下限；防抖影格數取最近數次辨識結果的眾數，1 表示不防抖。切換辨識模型會重置校準。

source: 点亮 %@
en: Lit %@

source: 点亮 %lld
en: Lit %lld

source: 点亮 %lld / %lld
en: %lld / %lld lit
ja: 点灯 %lld / %lld
zh_hant: 點亮 %lld / %lld

source: 点亮 LED
en: Turn on LED
ja: LED を点灯
zh_hant: 點亮 LED

source: 点亮此灯
en: Turn on this LED
ja: この LED を点灯
zh_hant: 點亮此燈

source: 点按下方按钮后才会请求读取
en: Reading is requested only after you tap the button below
ja: 下のボタンをタップした場合にのみ読み取りを要求します
zh_hant: 只有在你點一下下方按鈕後，App 才會要求讀取

source: 热点
en: Hotspot
ja: ホットスポット
zh_hant: 熱點

source: 热点 IP
en: Hotspot IP
ja: ホットスポット IP
zh_hant: 熱點 IP

source: 热点名称
en: Hotspot name
ja: ホットスポット名
zh_hant: 熱點名稱

source: 热点名称与密码
en: Hotspot name & password
ja: ホットスポット名とパスワード
zh_hant: 熱點名稱與密碼

source: 热点密码
en: Hotspot password
ja: ホットスポットのパスワード
zh_hant: 熱點密碼

source: 热点已开启
en: Hotspot is on
ja: ホットスポットはオンです
zh_hant: 熱點已開啟

source: 热点状态
en: Hotspot status
ja: ホットスポットの状態
zh_hant: 熱點狀態

source: 热点直连
en: Direct Hotspot
ja: ホットスポット直結
zh_hant: 熱點直連

source: 熄灭此灯
en: Turn off this LED
ja: この LED を消灯
zh_hant: 熄滅此燈

source: 版本
en: Version
ja: バージョン

source: 版本信息、项目链接与致谢。
en: Version info, project links and credits.
ja: バージョン情報、プロジェクトのリンク、クレジット。
zh_hant: 版本資訊、專案連結與致謝。

source: 状态
en: Status
ja: ステータス
zh_hant: 狀態

source: 状态: %@
en: Status: %@

source: 状态: %lld
en: Status: %lld

source: 状态未知
en: Status unknown
ja: 状態不明
zh_hant: 狀態未知

source: 璃奈板
en: Rina Board
ja: 璃奈ボード

source: 璃奈板名称
en: Rina board name
ja: 璃奈ちゃんボードの名前
zh_hant: 璃奈板名稱

source: 璃奈板已入网，正在建立 App 控制连接
en: The Rina board joined the network; establishing the app control connection
ja: 璃奈ちゃんボードがネットワークに接続しました。App の制御接続を確立中です
zh_hant: 璃奈板已加入網路，正在建立 App 控制連線

source: 璃奈板已加入网络；App 仍使用原来的控制连接
en: The Rina board joined the network; the app is still using its original control connection
ja: 璃奈ちゃんボードがネットワークに接続しました。App は引き続き元の制御接続を使用しています
zh_hant: 璃奈板已加入網路；App 仍使用原本的控制連線

source: 璃奈板已断开，同步仍在本机运行。点「停止同步」可关闭麦克风。
en: The board disconnected; sync is still running on this device. Tap Stop Sync to release the microphone.
ja: 璃奈ちゃんボードが切断されましたが、同期はこの端末で動作中です。「同期を停止」でマイクを解放できます。
zh_hant: 璃奈板已斷線，同步仍在本機執行。點「停止同步」可關閉麥克風。

source: 璃奈板当前 Wi-Fi
en: Rina board's current Wi-Fi
ja: 璃奈ちゃんボードの現在の Wi-Fi
zh_hant: 璃奈板目前的 Wi-Fi

source: 璃奈板直连热点
en: Rina board direct hotspot
ja: 璃奈ちゃんボードの直接接続用ホットスポット
zh_hant: 璃奈板直連熱點

source: 璃奈板网络与名称
en: Rina board network and name
ja: 璃奈ちゃんボードのネットワークと名前
zh_hant: 璃奈板網路與名稱

source: 生成中
en: Generating
zh_hant: 產生中

source: 生成帧数过多(%lld > 3072)，请缩短文字
en: Too many frames (%lld > 3072) — shorten the text
ja: 生成フレーム数が多すぎます（%lld > 3072）。テキストを短くしてください
zh_hant: 產生的影格過多（%lld > 3072），請縮短文字

source: 由你确认热点名称和密码，再发送给板子
en: Confirm the hotspot name and password, then send them to the board
ja: ホットスポット名とパスワードを確認してからボードに送信します
zh_hant: 由你確認熱點名稱和密碼，再傳送給板子

source: 电池
en: Battery
ja: バッテリー
zh_hant: 電池

source: 电池供电
en: Battery powered
ja: バッテリー駆動
zh_hant: 電池供電

source: 电池已断开
en: Battery disconnected
ja: バッテリーが外れています
zh_hant: 電池已斷開

source: 电池电压
en: Battery voltage
ja: バッテリー電圧
zh_hant: 電池電壓

source: 电池读数有效
en: Battery reading valid
ja: バッテリーの測定値は有効
zh_hant: 電池讀數有效

source: 电源
en: Power
ja: 電源
zh_hant: 電源

source: 电源：%@
en: Power: %@
ja: 電源：%@
zh_hant: 電源：%@

source: 电源维护与 ADC 模拟
en: Power maintenance and ADC simulation
ja: 電源メンテナンスと ADC シミュレーション
zh_hant: 電源維護與 ADC 模擬

source: 电源详情
en: Power details
ja: 電源の詳細
zh_hant: 電源詳細資料

source: 电源面板
en: Power panel
ja: 電源パネル
zh_hant: 電源面板

source: 电量
en: Battery
ja: バッテリー
zh_hant: 電量

source: 电量百分比
en: Battery percentage
ja: バッテリー残量のパーセント
zh_hant: 電量百分比

source: 男声
en: Male
zh_hant: 男聲

source: 画亮
en: Light
ja: 点ける
zh_hant: 畫亮

source: 画灭
en: Erase
ja: 消す
zh_hant: 畫滅

source: 画笔
en: Brush
ja: ブラシ
zh_hant: 畫筆

source: 画面适配
en: Scaling
ja: 画面の合わせ方
zh_hant: 畫面適配

source: 直连热点
en: Direct hotspot
ja: 直接接続用ホットスポット
zh_hant: 直連熱點

source: 直连热点 IP
en: Direct hotspot IP
ja: 直接接続用ホットスポットの IP
zh_hant: 直連熱點 IP

source: 直连热点名称
en: Direct hotspot name
ja: 直接接続用ホットスポット名
zh_hant: 直連熱點名稱

source: 相位锁定
en: Phase lock
ja: 位相ロック
zh_hant: 相位鎖定

source: 知道了
en: OK
ja: OK

source: 硬件与网络详情
en: Hardware and network details
ja: ハードウェアとネットワークの詳細
zh_hant: 硬體與網路詳細資料

source: 确定
en: OK
ja: OK
zh_hant: 確定

source: 确定要重启设备吗？
en: Are you sure you want to restart the device?
ja: デバイスを再起動しますか？
zh_hant: 確定要重新啟動裝置嗎？

source: 确认清空
en: Confirm clear
ja: 消去を確認
zh_hant: 確認清空

source: 视频
en: Video
ja: ビデオ
zh_hant: 影片

source: 视频会复制到 App 内保存，画面缩放到 22×18 点阵后按亮度转换为亮灭。
en: Videos are copied into the app. Each frame is scaled to the 22×18 grid and converted to on/off LEDs by brightness.
ja: ビデオはアプリ内にコピーされます。各フレームは 22×18 のドットに縮小され、明るさに応じて点灯/消灯に変換されます。
zh_hant: 影片會複製到 App 內保存，畫面縮放到 22×18 點陣後依亮度轉換為亮滅。

source: 视频预览，暂无内容
en: Video preview, nothing loaded
ja: ビデオプレビュー、内容なし
zh_hant: 影片預覽，暫無內容

source: 视频预览：%@
en: Video preview: %@
ja: ビデオプレビュー：%@
zh_hant: 影片預覽：%@

source: 离线
en: Offline
ja: オフライン
zh_hant: 離線

source: 移除
en: Remove
ja: 削除

source: 空闲
en: Idle
ja: 待機中
zh_hant: 閒置

source: 空闲 PSRAM
en: Free PSRAM
ja: 空き PSRAM
zh_hant: 可用 PSRAM

source: 空闲堆内存
en: Free heap memory
ja: 空きヒープメモリ
zh_hant: 可用堆積記憶體

source: 第 %lld 次重新连接
en: Reconnect attempt %lld
ja: 再接続 %lld 回目
zh_hant: 第 %lld 次重新連線

source: 第 %lld 行，第 %lld 列
en: Row %lld, column %lld
ja: %lld 行、%lld 列
zh_hant: 第 %lld 列，第 %lld 欄

source: 等待
en: Waiting
ja: 待機中

source: 管理表情
en: Manage faces
ja: 表情を管理

source: 类型
en: Type
ja: 種類
zh_hant: 類型

source: 粘贴帧数据…
en: Paste frame data…

source: 精确位置权限未开启；可手动填写
en: Precise Location is off; you can enter the name manually
ja: 正確な位置情報がオフです。名前は手入力できます
zh_hant: 精確位置權限未開啟；可手動填寫

source: 系统只允许在满足隐私条件时读取当前 SSID；无结果不等于没有网络。
en: The system discloses the current SSID only when its privacy requirements are met; no result does not mean there is no network connection.
ja: システムはプライバシー要件を満たす場合にのみ現在の SSID を提供します。結果がなくても、ネットワークに接続していないとは限りません。
zh_hant: 系統只會在符合隱私條件時提供目前的 SSID；沒有結果不代表沒有網路連線。

source: 系统无法提供名称时，可在这里手动记录
en: If the system cannot provide the name, you can record it here manually
ja: システムから名前を取得できない場合は、ここに手入力できます
zh_hant: 若系統無法提供名稱，可在這裡手動記錄

source: 系统未提供名称
en: The system did not provide a name
ja: システムから名前を取得できませんでした
zh_hant: 系統未提供名稱

source: 系统未提供名称；可手动填写
en: The system did not provide a name; you can enter it manually
ja: システムから名前を取得できませんでした。名前は手入力できます
zh_hant: 系統未提供名稱；可手動填寫

source: 系统要求精确位置才能披露 Wi-Fi 名称
en: The system requires Precise Location to disclose the Wi-Fi name
ja: Wi-Fi 名を取得するには、システムの「正確な位置情報」が必要です
zh_hant: 系統要求精確位置權限才能提供 Wi-Fi 名稱

source: 级别
en: Level
ja: レベル
zh_hant: 等級

source: 素材
en: Material

source: 终端
en: Terminal
ja: 端末
zh_hant: 終端機

source: 绘制和选择部件会更新已连接面板，并结束其他输出模式。
en: Drawing and selecting parts updates the connected board and ends other output modes.
ja: 描画やパーツの選択を行うと、接続中のボードが更新され、ほかの出力モードは終了します。
zh_hant: 繪製和選擇部件會更新已連線的面板，並結束其他輸出模式。

source: 继续
en: Resume
ja: 再開
zh_hant: 繼續

source: 继续输出到面板
en: Resume Output to Board
ja: ボードへの出力を再開
zh_hant: 繼續輸出到面板

source: 编辑
en: Edit
ja: 編集
zh_hant: 編輯

source: 编辑副本
en: Edit copy
ja: コピーを編集
zh_hant: 編輯副本

source: 缺少音频
en: Audio missing
ja: オーディオがありません
zh_hant: 缺少音訊

source: 网络 (详见连接页)
en: Network (see Connection page)
ja: ネットワーク（詳細は接続タブ）
zh_hant: 網路（詳見連線頁）

source: 网络与名称
en: Network and name
ja: ネットワークと名前
zh_hant: 網路與名稱

source: 网络名称
en: Network name
ja: ネットワーク名
zh_hant: 網路名稱

source: 网络模式
en: Network mode
ja: ネットワークモード
zh_hant: 網路模式

source: 脚本
en: Script
ja: スクリプト
zh_hant: 腳本

source: 脚本已就绪 · 需要导入音频
en: Script ready · Audio import required
ja: スクリプト準備完了 · オーディオの読み込みが必要
zh_hant: 腳本已就緒 · 需要匯入音訊

source: 脚本每行格式为 帧号!左眼,右眼,嘴巴,脸颊，帧号以脚本的 fps 为单位。
en: Each script line is frame!leftEye,rightEye,mouth,cheek, where the frame number is counted at the script's fps.
ja: スクリプトの各行は フレーム番号!左目,右目,口,頬 の形式です。フレーム番号はスクリプトの fps を単位とします。
zh_hant: 腳本每行格式為 影格號!左眼,右眼,嘴巴,臉頰，影格號以腳本的 fps 為單位。

source: 脚本编码无效，需为 UTF-8 文本
en: Invalid script encoding — UTF-8 text is required
ja: スクリプトのエンコーディングが不正です。UTF-8 テキストが必要です
zh_hant: 腳本編碼無效，必須是 UTF-8 文字

source: 自动
en: Auto
ja: 自動
zh_hant: 自動

source: 自动切换间隔
en: Auto-switch interval
ja: 自動切り替えの間隔
zh_hant: 自動切換間隔

source: 自动模式
en: Auto Mode
ja: 自動モード
zh_hant: 自動模式

source: 自动表情
en: Automatic faces
ja: 自動表情
zh_hant: 自動表情

source: 自动阈值
en: Auto Threshold
ja: 自動しきい値
zh_hant: 自動閾值

source: 自动阈值按每帧的平均亮度决定亮灭；抖动用点的疏密表现明暗。帧率越高越流畅，但蓝牙连接下面板可能跟不上，多余的帧会被丢弃。
en: Auto threshold lights LEDs based on each frame's average brightness; dithering shows light and shade through dot density. Higher frame rates are smoother, but over Bluetooth the board may not keep up, and extra frames are dropped.
ja: 自動しきい値は各フレームの平均輝度で点灯を決めます。ディザはドットの密度で明暗を表現します。フレームレートが高いほど滑らかですが、Bluetooth 接続ではボードが追いつかない場合があり、余分なフレームは破棄されます。
zh_hant: 自動閾值依每幀的平均亮度決定亮滅；抖動以點的疏密表現明暗。影格率越高越流暢，但藍牙連線下面板可能跟不上，多餘的影格會被捨棄。

source: 自定义
en: Custom
ja: カスタム
zh_hant: 自訂

source: 自定义…
en: Custom…
ja: カスタム…
zh_hant: 自訂…

source: 自定义板子直连热点
en: Customize board direct hotspot
ja: ボードの直接接続用ホットスポットをカスタマイズ
zh_hant: 自訂板子直連熱點

source: 自定义演出
en: Custom performance
ja: カスタム演出
zh_hant: 自訂演出

source: 自定义素材
en: Custom media
ja: カスタム素材
zh_hant: 自訂素材

source: 自定义脚本和音频分别导入；只有两者都有效时才能播放。
en: Import the custom script and audio separately. Playback is available only when both are valid.
ja: カスタムスクリプトとオーディオは別々に読み込みます。両方が有効な場合にのみ再生できます。
zh_hant: 自訂腳本和音訊需分別匯入；只有兩者都有效時才能播放。

source: 自由
en: Free-running
ja: フリーラン
zh_hant: 自由運行

source: 致谢
en: Credits
ja: クレジット
zh_hant: 致謝

source: 艺人
en: Artist
ja: アーティスト
zh_hant: 藝人

source: 草稿与面板不同
en: Draft differs from the board
ja: 下書きがボードと異なります
zh_hant: 草稿與面板不同

source: 草稿尚未保存到本机：%@
en: The draft could not be saved on this device: %@
ja: 下書きをこのデバイスに保存できませんでした：%@
zh_hant: 草稿尚未儲存到本機：%@

source: 获取信息
en: Get info
ja: 情報を取得
zh_hant: 取得資訊

source: 获取设备信息失败：%@
en: Failed to get device information: %@
ja: デバイス情報を取得できませんでした：%@
zh_hant: 取得裝置資訊失敗：%@

source: 获取设备信息成功
en: Device information retrieved
ja: デバイス情報を取得しました
zh_hant: 已取得裝置資訊

source: 蓝牙
en: Bluetooth
ja: Bluetooth
zh_hant: 藍牙

source: 蓝牙 · %@
en: Bluetooth · %@
ja: Bluetooth · %@
zh_hant: 藍牙 · %@

source: 表情
en: Faces

source: 表情位置
en: Face position
ja: 表情の位置

source: 表情名称
en: Face name

source: 表情已不可用
en: Face is no longer available
ja: この表情は利用できなくなりました
zh_hant: 表情已無法使用

source: 表情库
en: Face Library
ja: 表情ライブラリ
zh_hant: 表情庫

source: 表情显示
en: Faces
ja: 表情表示
zh_hant: 表情顯示

source: 表情草稿，%lld 颗灯点亮。可使用下方逐灯编辑。
en: Face draft with %lld LEDs lit. Use the controls below to edit individual LEDs.
ja: 表情の下書き。%lld 個の LED が点灯しています。下のコントロールで LED ごとに編集できます。
zh_hant: 表情草稿，%lld 顆燈已點亮。可使用下方控制項逐燈編輯。

source: 表情部件加载失败：%@
en: Could not load expression parts: %@
ja: 表情パーツを読み込めませんでした：%@
zh_hant: 表情元件載入失敗：%@

source: 表情预览：%@
en: Face preview: %@
ja: 表情プレビュー：%@
zh_hant: 表情預覽：%@

source: 覆盖原表情
en: Overwrite face
ja: 元の表情を上書き
zh_hant: 覆蓋原表情

source: 解析为预览
en: Parse as preview
ja: 解析してプレビュー
zh_hant: 解析為預覽

source: 解析并发送
en: Parse and send
ja: 解析して送信
zh_hant: 解析並傳送

source: 触感反馈
en: Haptics
ja: 触覚フィードバック
zh_hant: 觸覺回饋

source: 计算电压
en: Calculated voltage
ja: 計算電圧
zh_hant: 計算電壓

source: 让 iPhone 加入板子发出的 Wi-Fi 后直接连接
en: Join the board's Wi-Fi from the iPhone, then connect directly
ja: iPhone をボードの Wi-Fi に参加させて直接接続します
zh_hant: 讓 iPhone 加入板子發出的 Wi-Fi 後直接連線

source: 让璃奈板扫描热点
en: Have the Rina board scan for hotspots
ja: 璃奈ちゃんボードでホットスポットをスキャン
zh_hant: 讓璃奈板掃描熱點

source: 让璃奈板扫描网络
en: Have the Rina board scan for networks
ja: 璃奈ちゃんボードでネットワークをスキャン
zh_hant: 讓璃奈板掃描網路

source: 记住上次的标签页
en: Remember last tab
ja: 前回のタブを記憶
zh_hant: 記住上次的標籤頁

source: 设备
en: Device
ja: デバイス
zh_hant: 裝置

source: 设备拒绝
en: Rejected by device
ja: デバイスが拒否
zh_hant: 裝置拒絕

source: 设备未连接
en: Board not connected
ja: デバイスが接続されていません
zh_hant: 裝置未連線

source: 设备概览
en: Device overview
ja: デバイスの概要
zh_hant: 裝置總覽

source: 设定
en: Settings
ja: 設定
zh_hant: 設定

source: 设置
en: Settings
ja: 設定
zh_hant: 設定

source: 识别
en: Recognition
ja: 認識
zh_hant: 辨識

source: 识别与高级设置
en: Identification and advanced settings
ja: 識別と詳細設定
zh_hant: 識別與進階設定

source: 识别模型
en: Voice model
ja: 音声モデル
zh_hant: 辨識模型

source: 该文件不包含视频画面
en: This file has no video track
ja: このファイルには映像がありません
zh_hant: 此檔案不包含影片畫面

source: 详细
en: Verbose
ja: 詳細
zh_hant: 詳細

source: 请先导入视频
en: Import a video first
ja: 先にビデオを読み込んでください
zh_hant: 請先匯入影片

source: 请先连接璃奈板
en: Connect to a Rina board first
ja: 先に璃奈ちゃんボードへ接続してください
zh_hant: 請先連線璃奈板

source: 请先连接面板，或保存到本机。
en: Connect to a board first, or save to this device.
ja: 先にボードへ接続するか、このデバイスに保存してください。
zh_hant: 請先連線面板，或儲存到本機。

source: 请先选择有效的脚本和音频
en: Select a valid script and audio file first
ja: 先に有効なスクリプトとオーディオを選択してください
zh_hant: 請先選擇有效的腳本和音訊

source: 请先通过蓝牙或其他方式连接璃奈板
en: Connect to the Rina board over Bluetooth or another method first
ja: 先に Bluetooth または別の方法で璃奈ちゃんボードへ接続してください
zh_hant: 請先透過藍牙或其他方式連線璃奈板

source: 请尝试其他名称。
en: Try a different name.
ja: 別の名前をお試しください。
zh_hant: 請嘗試其他名稱。

source: 请求速度
en: Requested speed
ja: 要求速度
zh_hant: 要求速度

source: 请输入指令名，或包含 cmd 字段的 JSON 对象。
en: Enter a command name or a JSON object containing cmd.
ja: コマンド名、または cmd フィールドを含む JSON オブジェクトを入力してください。
zh_hant: 請輸入指令名稱，或包含 cmd 欄位的 JSON 物件。

source: 请输入热点名称
en: Enter the hotspot name
ja: ホットスポット名を入力してください
zh_hant: 請輸入熱點名稱

source: 请输入要滚动显示的文字
en: Enter the text to scroll
ja: スクロール表示するテキストを入力してください
zh_hant: 請輸入要跑馬燈顯示的文字

source: 读取 iPhone 当前 Wi-Fi
en: Read iPhone's current Wi-Fi
ja: iPhone の現在の Wi-Fi を読み取る
zh_hant: 讀取 iPhone 目前的 Wi-Fi

source: 读取失败
en: Could not read
ja: 読み取りに失敗しました
zh_hant: 讀取失敗

source: 读取失败：%@
en: Could not read: %@
ja: 読み取りに失敗しました：%@
zh_hant: 讀取失敗：%@

source: 读取当前 Wi-Fi
en: Read current Wi-Fi
ja: 現在の Wi-Fi を読み取る
zh_hant: 讀取目前的 Wi-Fi

source: 读取面板表情失败：%@
en: Failed to read board faces: %@
ja: ボードの表情を読み込めませんでした：%@
zh_hant: 讀取面板表情失敗：%@

source: 读数来自最近一次 GET_STATUS、GET_POWER 与 get_info；功耗由状态中的点亮数、亮度和颜色在本机估算。
en: Readings come from the latest GET_STATUS, GET_POWER, and get_info responses. Power is estimated on this device from the reported LED count, brightness, and color.
ja: 値は直近の GET_STATUS、GET_POWER、get_info から取得します。消費電力は、報告された点灯数、明るさ、色を使ってこのデバイス上で推定します。
zh_hant: 讀數來自最近一次 GET_STATUS、GET_POWER 與 get_info；功耗會依狀態中的點亮數、亮度和顏色在本機估算。

source: 读数正常
en: Reading normal
ja: 読み取り値は正常
zh_hant: 讀數正常

source: 调试
en: Debug
ja: デバッグ
zh_hant: 除錯

source: 调试工作区
en: Debug workspace
ja: デバッグワークスペース
zh_hant: 偵錯工作區

source: 调试工具
en: Debug tools
ja: デバッグツール
zh_hant: 除錯工具

source: 调试输出
en: Debug output
ja: デバッグ出力
zh_hant: 偵錯輸出

source: 警告
en: Warning

source: 警告以上
en: Warnings and errors
zh_hant: 警告與錯誤

source: 超出固件 %lld 字节上限，发送前请缩短文字；不会自动截断。
en: Over the firmware's %lld-byte limit — shorten the text before sending; it is never truncated silently.
ja: ファームウェアの上限 %lld バイトを超えています。送信前にテキストを短くしてください。自動では切り詰められません。
zh_hant: 超出韌體 %lld 位元組上限，傳送前請縮短文字；不會自動截斷。

source: 转换
en: Conversion
ja: 変換
zh_hant: 轉換

source: 转换方式
en: Method
ja: 変換方式
zh_hant: 轉換方式

source: 轻点以应用到面板。
en: Tap to apply to the board.
ja: タップするとボードに適用されます。
zh_hant: 點一下即可套用到面板。

source: 输入 CLEAR 以确认
en: Type CLEAR to confirm
ja: 確認のため CLEAR と入力
zh_hant: 輸入 CLEAR 以確認

source: 输入要滚动的文字…
en: Enter the text to scroll…
ja: スクロールさせるテキストを入力…
zh_hant: 輸入要跑馬燈顯示的文字…

source: 边框
en: Border
ja: 枠線
zh_hant: 邊框

source: 这个列表由璃奈板扫描，不是 iPhone 扫描。请自行选择属于你的个人热点；App 无法识别热点所有者。
en: This list is scanned by the Rina board, not the iPhone. Choose your Personal Hotspot yourself; the app cannot identify a hotspot's owner.
ja: このリストは iPhone ではなく璃奈ちゃんボードがスキャンしたものです。自分のインターネット共有を選択してください。App はホットスポットの所有者を識別できません。
zh_hant: 此列表由璃奈板掃描，不是由 iPhone 掃描。請自行選擇你的個人熱點；App 無法辨識熱點擁有者。

source: 这个已保存设备没有可用的连接地址，请重新扫描
en: This saved device has no usable connection address. Scan again.
ja: この保存済みデバイスには使用できる接続先がありません。もう一度スキャンしてください。
zh_hant: 這個已儲存的裝置沒有可用的連線位址，請重新掃描。

source: 这首没有音频文件。运行 tools/fetch_preset_live_audio.sh 获取，或改选「自定义…」导入你自己的音频。
en: This one has no audio file. Run tools/fetch_preset_live_audio.sh to fetch it locally, or switch to "Custom…" and import your own.
ja: この曲にはオーディオファイルがありません。tools/fetch_preset_live_audio.sh で取得するか、「カスタム…」から自分のオーディオを読み込んでください。
zh_hant: 這首沒有音訊檔案。執行 tools/fetch_preset_live_audio.sh 取得，或改選「自訂…」匯入你自己的音訊。

source: 连接
en: Connect
ja: 接続
zh_hant: 連線

source: 连接与设备
en: Connection and device
ja: 接続とデバイス
zh_hant: 連線與裝置

source: 连接中
en: Connecting
ja: 接続中
zh_hant: 連線中

source: 连接同一网络中的璃奈板
en: Connect to a Rina board on the same network
ja: 同じネットワーク上の璃奈ちゃんボードに接続
zh_hant: 連線同一網路中的璃奈板

source: 连接后可查看和管理当前面板的表情。
en: Connect to view and manage faces on the current board.
ja: 接続すると、現在のボードにある表情を表示して管理できます。
zh_hant: 連線後可查看和管理目前面板的表情。

source: 连接失败
en: Connection failed
ja: 接続に失敗しました
zh_hant: 連線失敗

source: 连接失败 · 点此重试
en: Connection failed · Tap to try again
ja: 接続に失敗 · タップして再試行
zh_hant: 連線失敗 · 點一下以重試

source: 连接失败，请重试
en: Connection failed. Try again.
ja: 接続に失敗しました。もう一度お試しください。
zh_hant: 連線失敗，請再試一次。

source: 连接失败：%@
en: Connection failed: %@
ja: 接続に失敗しました：%@
zh_hant: 連線失敗：%@
